[
  {
    "title": "Hayden Building Maintenance Corp.",
    "image": "https://i.imgur.com/5uJ3dak.png",
    "about": "The Hayden Building Maintenance Corp website is a modern and responsive web application designed to showcase the company's services and offerings in the roofing industry. The site is built using React, a popular JavaScript library, ensuring a seamless and dynamic user experience. It features components like react-icons, react-scroll, and react-youtube to enhance user engagement and navigation. The project utilizes styled-components for a visually appealing and consistent design across different devices. The back end is powered by Node.js and Express, utilizing technologies like axios, cors, and nodemailer to handle server-side tasks. Additionally, the site utilizes react-router-dom for efficient client-side routing and navigation. Overall, the Hayden Building Maintenance Corp website combines a range of modern technologies to create a professional and user-friendly online platform.",
    "technologies": [
      "React",
      "styled-components",
      "Node.js",
      "Express",
      "axios",
      "cors",
      "nodemailer",
      "react-icons",
      "react-scroll",
      "react-youtube",
      "react-router-dom"
    ],
    "repo": "https://github.com/ojc011/HBM-Site/tree/main",
    "site": "https://protected-headland-88748-bda816a51a41.herokuapp.com/"
  },  
  {
    "title": "SCBeauty",
    "image": "https://i.imgur.com/ehfoxXg.png",
    "about": "SCBeauty is a modern web application built using TypeScript, a typed superset of JavaScript that adds additional features to the language to improve code quality and maintainability. TypeScript is used throughout the project to ensure type safety and reduce errors. The front-end of the application is built with React.js, a popular JavaScript library used for building user interfaces. React.js is used to create components that make up the application's user interface. These components are written in a combination of TypeScript, JavaScript, CSS, and HTML. TypeScript is used to define the props and state of each component, while JavaScript is used to handle logic and events. CSS is used to style the components, and HTML is used to structure the content. The back-end of the application is built with Node.js, a popular JavaScript runtime built on the V8 engine. Node.js is used in conjunction with Express, a lightweight web framework for Node.js, to handle incoming requests and serve data from the database. Overall, SCBeauty2 leverages a combination of technologies and programming languages to create a fast, scalable, and user-friendly web application.",
    "technologies": [
      "ReactJS",
      "NodeJS",
      "TypeScript",
      "JavaScript",
      "Pagination",
      "Netlify"
    ],
    "repo": "https://github.com/ojc011/SCBeauty2",
    "site": "https://scbeauty4u.com/"
  },
  {
    "title": "eCommerce - Firebase",
    "image": "https://i.imgur.com/D8zic5R.png",
    "about": "Massive e-commerce application similar to Shopify using React, Redux, React Hooks, React Suspense, React Router, GraphQL, Context API, Firebase, Redux-Saga, Stripe + more. This is a full stack app (MERN stack), using Firebase.",
    "technologies": [
      "ReactJS",
      "NodeJS",
      "Stripe",
      "Redux",
      "Authentication",
      "Styled Components"
    ],
    "repo": "https://github.com/ojc011/ecommerce-business",
    "site": "https://sunny-capybara-4ce7ae.netlify.app/"
  },
  {
    "title": "Monsters Rolodex",
    "image": "https://i.imgur.com/mb4GoXg.png",
    "about": "A demo, single-paged react project which displays Robots, their names, and details about them in a card styled homepage. You also have the ability to sort through the monsters.",
    "technologies": ["ReactJS", "NodeJS", "HTML", "CSS", "JavaScript"],
    "repo": "https://github.com/ojc011/monsters-rolodex",
    "site": "https://ojc011.github.io/monsters-rolodex/"
  },
  {
    "title": "Ruby Address Book",
    "image": "https://i.imgur.com/dmYNsLw.png",
    "about": "A simple address book using Ruby on Rails with user authentication (login/signup).",
    "technologies": [
      "Ruby",
      "Ruby on Rails",
      "JavaScript",
      "PostgreSQL",
      "HTML",
      "SCSS"
    ],
    "repo": "https://github.com/ojc011/WLTechAssess-OC",
    "site": "https://still-wildwood-14883.herokuapp.com/"
  },
  {
    "title": "eCommerce-Full-Stack Project",
    "image": "https://i.imgur.com/fIFgTto.png",
    "about": "Using MERN stack, This is an ecommerce website using javascript, css, html, mongodb, react, express, node, etc.",
    "technologies": ["JavaScript", "MongoDB", "Express", "ReactJS", "NodeJS"],
    "repo": "https://github.com/ojc011/ecommercebiz",
    "site": "https://mern-ecommercebiz-oliver.herokuapp.com/"
  },
  {
    "title": "Coding Buddy",
    "image": "https://github.com/ojc011/Coding-buddy/raw/main/public/images/coding-buddy-img.jpg",
    "about": "These days more and more people are trying to learn to code in their own free time and online. This doesnt present many opportunities to collaborate or work with other people. This applicaiton presents the opportunity to work with other people who might have skills in areas you might be lacking as well as you help them out in areas you might be strong in.",
    "technologies": ["Node", "Express", "Handlebars", "MySQL", "JavaScript"],
    "repo": "https://github.com/ojc011/Coding-buddy",
    "site": "https://coding-bud.herokuapp.com/"
  },
  {
    "title": "Run Buddy",
    "image": "https://i.imgur.com/yZd4eub.png",
    "about": "A model website that would offer fitness training services",
    "technologies": ["CSS", "HTML"],
    "repo": "https://github.com/ojc011/run-buddy",
    "site": "https://ojc011.github.io/run-buddy/"
  },
  {
    "title": "Chef Foluke",
    "image": "https://i.imgur.com/RrAhVpR.png",
    "about": "Small business are always looking for a way to get the word out there reach potential customers. For this project we decided to help out a personal chef who was in need of a functional website. Previously, Chef Foluke had a website built, but was not fully functioning. We decided to help fill in that gap.",
    "technologies": ["ReactJS", "Node", "HTML", "CSS", "MongoDB", "Mongoose"],
    "repo": "https://github.com/MaverickCavazos/personal-chef",
    "site": "https://guarded-headland-93069.herokuapp.com/"
  }
]
